---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DecalFailures.CannotPaste
source: html/249eff42-26af-079f-6db6-d1c794d84abb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DecalFailures.CannotPaste Property

Can't place Decal at new position.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPaste { get; }
```